Data/Final_Implemented_data/Request/400 requests/least/test_least2.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   17.741 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      41036000 bytes
HTML transferred:       40960000 bytes
Requests per second:    22.55 [#/sec] (mean)
Time per request:       443.532 [ms] (mean)
Time per request:       44.353 [ms] (mean, across all concurrent requests)
Transfer rate:          2258.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       65  346 132.1    329     669
Processing:     1   94  80.3     76     368
Waiting:        0   91  79.6     75     366
Total:         68  440 169.8    429     943

Percentage of the requests served within a certain time (ms)
  50%    429
  66%    513
  75%    568
  80%    595
  90%    675
  95%    734
  98%    808
  99%    847
 100%    943 (longest request)